app/controllers/base_controller.rb

  def index
    @bases = Base.all
---
SELECT "bases".* FROM "bases"

  def create
    @new_base = Base.new(base_params)
    if @new_base.save
---
INSERT INTO "bases" ("host", "name", "username", "password", "port", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["host", "host"], ["name", "Sheba"], ["username", "Jan"], ["password", "põld"], ["port", 5], ["created_at", "2017-09-21 17:20:51.828459"], ["updated_at", "2017-09-21 17:20:51.828459"]]